app/views/weekly_journals/_pagination.html.erb

SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."week" = 70 ORDER BY created_at
---
  <ul>
    <% WeeklyJournal.weeks_info.each do |week| %>