app/controllers/positive_energies_controller.rb

SELECT "positive_energies".* FROM "positive_energies" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "positive_energies"
---
  def index
    @positive_energies = PositiveEnergy.paginate(:page => params[:page] || 1, :per_page => 20)