app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @weekly_journals = @user.weekly_journals.order("created_at DESC").paginate(:page => params[:page] || 1, :per_page => 5)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "25"]]
SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."user_id" = 25 ORDER BY created_at DESC LIMIT 5 OFFSET 0