app/controllers/weekly_journals_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."weekly_journal_id" = 943
SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."week" = 70 ORDER BY created_at
---
  def index
    @week = params[:week] || smart_week
    @week_instance = Week.new(@week)
    @weekly_journals = WeeklyJournal.on_week(@week).includes(:comments)

SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."id" = $1 LIMIT 1  [["id", "967"]]
---
  def show
    @weekly_journal = WeeklyJournal.find(params[:id])

INSERT INTO "weekly_journals" ("content", "created_at", "month", "title", "updated_at", "user_id", "visited_times", "week", "year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @weekly_journal = WeeklyJournal.new(params[:weekly_journal])
    @weekly_journal.author = current_user
    if params[:week]
      @weekly_journal.week = params[:week]
    end
    if @weekly_journal.save

SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."id" = $1 LIMIT 1  [["id", "967"]]
---
  def edit
    @weekly_journal = WeeklyJournal.find(params[:id])

SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."id" = $1 LIMIT 1  [["id", "967"]]
UPDATE "weekly_journals" SET "content" = '[img]/uploads/upload_file/image/240/ll.jpeg[/img]
---
  def update
    @weekly_journal = WeeklyJournal.find(params[:id])
    journal_authorise
    if @weekly_journal.update_attributes(params[:weekly_journal])

SELECT "weekly_journals".* FROM "weekly_journals" WHERE "weekly_journals"."id" = $1 LIMIT 1  [["id", "944"]]
---
  def vote
    @weekly_journal = WeeklyJournal.find(params[:id])